app/controllers/event1s_controller.rb

  def index
    @event1s = Event1.all
---
SELECT * FROM `event1s`