app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT * FROM `events`

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 1)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 10)

  def subscribe
    event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` = 9)

  def create
    @event = Event.new(params[:event])
    @event.save!
---
INSERT INTO `events` (`start_date`, `location`, `created_at`, `attendees`, `updated_at`, `description`, `end_date`) VALUES(NULL, NULL, '2011-03-15 10:01:21', NULL, '2011-03-15 10:01:21', NULL, NULL)

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM `events` WHERE (`events`.`id` = 10)
UPDATE `events` SET `updated_at` = '2011-03-16 06:46:51', `start_date` = '2011-03-16 03:45:00', `location` = 'Mumbai', `end_date` = '2011-03-18 06:45:00' WHERE `id` = 15